import React from "react";

export default function PrivacyPolicyContent() {
  return (
    <div className="bg-white flex flex-col items-center mx-auto p-6 sm:p-12 py-12 text-right text-gray-800">
      <h1 className="text-3xl md:text-5xl font-bold md:mb-12 mb-8 max-w-lg md:text-center">
        سياسة الخصوصية لشركة مهلة زمنية للتمويل
      </h1>
      <div className="flex flex-col max-w-full sm:max-w-xl">
        <section className="mb-3 font-semibold">
          <h2 className="text-2xl  mb-2">سياسة الخصوصية</h2>
          <p className="text-2xl leading-relaxed">شركة مهلة زمنية للتمويل</p>
        </section>

        <section className="mb-8 space-y-4 sm:space-y-6 border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-2">المقدمة</h2>
          <p className="leading-relaxed md:text-base text-sm">
            نحن شركة مهلة زمنية للتمويل ("مهلة" أو "الشركة" أو "نحن")، شركة
            مرخصة من قبل البنك المركزي السعودي (ساما) لتقديم خدمات تمويلية في
            المملكة العربية السعودية. نقوم بتمكين عملائنا من الحصول على تمويل
            استهلاكي مصغر من خلال التقنية المالية، بشكل شبه فوري بالكامل من خلال
            الوسائل الرقمية دون الحاجة إلى زيارة الفرع الفعلي للشركة.
          </p>
          <p className="md:text-base text-sm">
            نتعهد كشركة بحماية خصوصية بياناتك الشخصية، ولذلك أنشأنا سياسة
            الخصوصية هذه لإثبات التزامنا الراسخ بخصوصيتك. قمنا بتطوير هذه
            السياسة لمساعدتك على فهم ممارسات جمع البيانات ونشرها، وتُستخدم
            البيانات التي تم جمعها على موقعنا الإلكتروني لتوفير الخدمات التي
            تقدمها شركة مهلة ولن يتم بيعها أبدًا على أساس فردي.
          </p>
          <p className="md:text-base text-sm">
            قد يستخدم موقع مهلة ملفات تعريف الارتباط بالمتصفح للحفاظ على معلومات
            حول جلسة الموقع الخاصة بك، وعلى الأخص "حالة" جلسة الويب الحالية.
            تساعدنا ملفات تعريف الارتباط في التعرف عليك؛ هذا بدوره يعزز تجربتك
            في الموقع.
          </p>
        </section>

        <section className="mb-12 space-y-4 border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            البيانات الشخصية
          </h2>
          <p className="md:text-base text-sm">
            مبدئيًا نوضح للعميل أنواع البيانات والمعلومات التي نجمعها مباشرة عند
            استخدام تطبيق "مهلة" أو الموقع الإلكتروني أو الدردشة المباشرة أو
            مركز الاتصال، كما نقدم إرشادات حول كيفية استخدامنا لهذه البيانات.
          </p>
          <p className="md:text-base text-sm">
            تحكم هذه السياسة جمع واستخدام المعلومات التي يتم جمعها من خلال تطبيق
            أو الموقع الإلكتروني الخاص بالشركة، بالإضافة إلى أن في هذه السياسة
            نوضح نوعين من البيانات التي نجمعها نيابة عنك: "بيانات التعريف" و
            "البيانات غير المحددة للهوية". أولًا: "بيانات التعريف" تعني أي
            بيانات يمكن أن تحدد هويتك بشكل صريح، تتضمن على سبيل المثال لا الحصر:
            معلومات مثل اسمك، أو رقم جواز السفر. ومن ناحية أخرى تشتمل "البيانات
            غير المحددة للهوية" على سبيل المثال لا الحصر: معلومات لا يمكنها
            بمفردها تمكين الارتباط المباشر بك أو بأي شخص طبيعي أو اعتباري آخر،
            كالمنطقة التي تعيش فيها، ونظام التشغيل الخاص بك، ونوع المتصفح،
            ومعلومات حول أنشطة المستخدم على تطبيق مهلة، مثل عدد مرات زيارة
            الصفحات وما إلى ذلك.
          </p>
          <p className="md:text-base text-sm">
            بالإضافة إلى أنه عند تنفيذ المعاملات باستخدام تطبيق مهلة، ستقوم مهلة
            بإنشاء سجلات لهذه المعاملات والاحتفاظ بها. ويقوم تطبيق مهلة أيضًا
            بجمع بيانات التعريف المالي عند ربط بطاقات الدفع (مثل بطاقة الائتمان
            أو الخصم الخاصة بك) بحساب مهلة الخاص بك.
          </p>
          <p className="md:text-base text-sm">
            يتم التحقق من صحة المعلومات التي تقدمها من خلال معلومات التحقق التي
            تحصل عليها شركة علم، وخدمة يقين، من منصة أبشر التابعة لوزارة
            الداخلية في المملكة العربية السعودية، والشركة السعودية للمعلومات
            الائتمانية (سمة)، والهيئة السعودية للبيانات والذكاء الاصطناعي
            (نفاذ)، وخدمة المصرفية المفتوحة.
          </p>
        </section>

        <section className="mb-8 md:space-y-4 space-y-6 border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            الغرض من جمع البيانات
          </h2>
          <p>
            تستخدم مهلة زمنية للتمويل البيانات التي تجمعها للقيام على سبيل
            المثال لا الحصر بما يلي:
          </p>
          <ul
            className="list-disc list-inside text-right space-y-2"
            style={{ listStylePosition: "inside", direction: "rtl" }}
          >
            <li>تقديم الخدمات الخاصة بك في تطبيق أو موقع مهلة. </li>
            <li>تقييم خدماتنا وتحسينها وتطويرها.</li>
            <li>للحفاظ على أنظمة وخدمات تطبيق مهلة آمنة ومأمونة. </li>

            <li>
              {" "}
              لإمكانية الرد عليك والتواصل معك من خلال شركة مهلة زمنية للتمويل.
            </li>
            <li> لتنفيذ أي اتفاقيات أخرى بينك وبين شركة مهلة زمنية للتمويل.</li>
          </ul>
          <h3>
               تلتزم مهلة بالحفاظ على سرية بيانات التعريف الخاصة بك وجعلها متاحة
            فقط
          </h3>
          <ul
            className="list-disc list-inside text-right md:text-base text-sm space-y-2"
            style={{ listStylePosition: "inside", direction: "rtl" }}
          >
            <li>بناء على طلبك، أو أثناء تسجيل الدخول على صفحتك.</li>
            <li>
              إلى الجهة التنظيمية المعتمدة (البنك المركزي السعودي) عند تقديم طلب
              من البنك المركزي السعودي.
            </li>
            <li>
              بأمر من أي سلطة مختصة في المملكة العربية السعودية والتي تشمل
              المحاكم والهيئات التنفيذية والتنظيمية.
            </li>
          </ul>
          <div>
            <p>
              <span className="font-bold"> حقوق أصحاب البيانات الشخصية : </span>
              تبذل مهلة قصارى جهدها لتقديم خدمات عالية الجودة لجميع أصحاب
              البيانات الشخصية بما يضمن حقوقهم في الحدود المنصوص عليها في نظام
              حماية البيانات الشخصية والأنظمة الأخرى وفقًا لما يلي:
            </p>
            <ul
              className="list-disc list-inside text-right space-y-2 md:text-base text-sm"
              style={{ listStylePosition: "inside", direction: "rtl" }}
            >
              <li>
                الحق في العلم: يحق لصاحب البيانات الشخصية أن يكون على دراية عند
                جمع واستخدام بياناته الشخصية.
              </li>
              <li>
                الحق في طلب الوصول: يحق لصاحب البيانات الشخصية الوصول إلى
                بياناته الشخصية بصورة واضحة وقابلة للقراءة.
              </li>
              <li>
                الحق في التحديث: يحق لصاحب البيانات الشخصية طلب تصحيح بياناته أو
                إكمالها أو تعديلها.
              </li>
            </ul>
          </div>
          <p>
            تخزين المعلومات: تلتزم شركة مهلة بتخزين بيانات التعريف الخاصة بك،
            بما في ذلك سجلات المعاملات على خادم محلي يقع في المملكة العربية
            السعودية، لمنحك سهولة الوصول والامتثال للتشريعات السائدة بشأن تخزين
            البيانات الشخصية في المملكة.
          </p>
          <p>
            <span className="font-bold">حماية المعلومات :</span>: تتخذ شركة مهلة
            الإجراءات الفنية والتنظيمية المناسبة لحماية معلوماتك من الفقد، أو
            التلف، أو التغيير، أو الإفصاح، أو الوصول، أو الاستخدام العرضي وغير
            القانوني.
          </p>
          <p>
            <span className="font-bold">تفويض الشركة : </span>بما يتماشى مع
            متطلبات البنك المركزي السعودي، أنت تفوض مهلة بالاحتفاظ بسجلات كل
            معاملة لمدة عشر سنوات من تاريخ المعاملة، وتفوض مهلة لأرشفة بياناتك
            عند انتهاء هذه الفترات.
          </p>
          <p>
            <span className="font-bold">عدم الإفصاح</span>: تقع على عاتق
            المستخدمين مسؤولية عدم الإفصاح في جميع الأوقات عن أي معلومات شخصية
            أو مالية فيما يتعلق بالخدمات المقدمة من خلال مهلة زمنية للتمويل إلى
            أي شخص آخر غير شركة مهلة زمنية للتمويل تحت أي ظرف من الظروف باستثناء
            المتطلبة من الجهات الرسمية في المملكة العربية السعودية.
          </p>{" "}
        </section>

        <section className="mb-8 md:space-y-4 space-y-6 border-b py-5">
          <h2 className="text-xl md:text-2xl font-semibold mb-4">
            حقوق الملكية
          </h2>
          <p className="leading-relaxed">
            إن حقوق الطبع والنشر والمعلومات والمواد المتوفرة والموجودة على موقع
            شركة مهلة زمنية للتمويل أو التطبيق هي أصول تعود ملكيتها للشركة. يمنع
            منعًا باتًا نسخها أو نشرها أو استخدامها بطريقة تخالف ما نشرت لأجله
            أو أن تستغل لأهداف ومصالح شخصية دون إذن خطي مسبق من الشركة. لذا في
            أي من حالات الاستخدام النظامي، يجب الإشارة إلى شركة مهلة زمنية
            للتمويل كمصدر لتلك المعلومات.
          </p>
        </section>

        <section className=" mb-8 md:space-y-4 space-y-6  border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            التعديل على سياسة الخصوصية
          </h2>
          <p className="leading-relaxed md:text-base text-sm">
            تحتفظ الشركة بالحق في تحديث سياسة الخصوصية هذه بشكل دوري، وستكون
            النسخة المحدثة من هذه السياسة سارية فور نشرها ما لم ينص على خلاف
            ذلك. في حالة إجراء تغييرات جوهرية، سيتم إخطار المستخدمين عبر البريد
            الإلكتروني أو من خلال إشعار بارز على الموقع قبل سريان التغييرات. نحث
            المستخدمين على مراجعة هذه السياسة بانتظام للبقاء على اطلاع
            بالتعديلات. استمرار استخدامك للمنصة بعد نشر التحديثات يُعتبر موافقةً
            منك على السياسة المعدلة.
          </p>
        </section>

        <section className="mb-8 md:space-y-4 space-y-6 border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">أحكام عامة</h2>
          <ul
            className=" list-decimal text-right space-y-2"
            style={{ listStylePosition: "inside", direction: "rtl" }}
          >
            <li>
              تحت أي ظرف من الظروف، لن تتحمل الشركة وأي من شركاتها التابعة أو
              المالكة لها أو شركاؤها، أو موظفوها، أو مسؤولها، أو مديروها، أو
              الجهات التي تتعامل معها أية مسؤولية تجاه المستخدم أو تجاه أي شخصٍ
              آخر عن أي تكاليف أو أضرار (بما في ذلك أي أضرار خاصة، أو غير
              مقصودة، أو تأديبية، أو غير مباشرة، أو لاحقة)، أو أي مسؤولية من أي
              نوع، تنشأ أو تنتج عن جمع معلومات شخصية، أو استخدامها، أو نقلها، أو
              معالجتها، أو تخزينها كنتيجة لدخول المستخدم لأي من قنواتها
              الإلكترونية.
            </li>
            <li>
              لا تتحمل الشركة المسؤولية عن أي ضرر أو خسائر قد تنتج عن الوصول غير
              المصرح به أو الهجمات السيبرانية التي تقع خارج نطاق سيطرتها، بشرط
              أن تكون الشركة قد اتخذت جميع الإجراءات المعقولة لحماية البيانات.
            </li>
            <li>
              تكون كافة النزاعات المتعلقة بسياسة الخصوصية هذه بسبب استخدام أي من
              القنوات الإلكترونية للشركة وأي من الخدمات المقدمة من خلالها، خاضعة
              للقوانين والأنظمة ذات العلاقة في المملكة العربية السعودية، وتكون
              المحاكم والجهات القضائية المختصة هي صاحبة الاختصاص في النظر
              بالنزاعات وفقاً لسياسة الخصوصية هذه.
            </li>
            <li>
              في حالة وجود أية استفسارات أو آراء حول سياسة الخصوصية، يمكن
              التواصل مع الشركة.
            </li>
            <li>
              لا تنطبق هذه السياسة على المعلومات التي تم الحصول عليها بطرق أخرى
              أو على أي مواقع، أو منتجات، أو برامج، أو خدمات أخرى يمكنك الوصول
              إليها بشكل مستقل عن تطبيق مهلة أو موقع مهلة.
            </li>
            <li>
              لا تنطبق هذه السياسة على جمع البيانات وممارسات أي أطراف ثالثة قد
              تتعاقد معها باستخدام تطبيق مهلة أو فيما يتعلق به، بما في ذلك على
              سبيل المثال لا الحصر: التجار أو مزود خدمة الهاتف المحمول الخاص بك.
            </li>
            <li>
              {" "}
              تماشيًا مع توجيهات البنك المركزي السعودي التي تتوجب تحديد الحد
              الأقصى لمبلغ القرض الذي يحق لك الحصول عليه، تقوم الشركة بجمع أي
              معلومات خاصة بك من المؤسسة العامة للتأمينات الاجتماعية ومن الشركة
              السعودية للمعلومات الائتمانية (سمة)، ويُلزم البنك المركزي السعودي
              جميع مؤسسات الخدمات المالية بجمع هذه المقاييس على النحو المنصوص
              عليه في التعميم الرسمي للبنك المركزي السعودي رقم 46538/99 بتاريخ
              02/09/1439ه بعنوان "مبادئ التمويل المسؤول للعملاء الأفراد".
            </li>
          </ul>{" "}
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            المساعدة والدعم
          </h2>
          <div>
            <ul
              className="list-disc list-inside text-right space-y-2"
              style={{ listStylePosition: "inside", direction: "rtl" }}
            >
              <li>
                في حال وجود أي استفسارات أو طلب المساعدة والدعم بخصوص سياسة
                الخصوصية هذه، يمكنكم التواصل مع شركة مهلة زمنية من خلال القنوات
                المتاحة على موقع أو تطبيق مهلة.
              </li>{" "}
              <li>
                لمزيد من المعلومات، يرجى الاطلاع على مبادئ وقواعد حماية عملاء
                المؤسسات المالية الصادرة عن البنك المركزي السعودي.
              </li>{" "}
              <li>
                من خلال الوصول إلى تطبيق مهلة أو الموقع الخاص بمهلة أو استخدامه،
                فإنك توافق على الممارسات الموضحة في هذه السياسة، وإذا كنت لا
                توافق عليها، فلا يجب عليك الوصول إلى تطبيق مهلة زمنية للتمويل أو
                استخدامه.
              </li>
            </ul>
          </div>
        </section>
      </div>
    </div>
  );
}
