import React from "react";

const TermsSection = () => {
  return (
    <div className="bg-white flex flex-col items-center mx-auto p-6 sm:p-12 py-12 text-right text-gray-800">
      <h1 className="text-3xl md:text-5xl font-bold md:mb-12 mb-8 max-w-lg md:text-center">
        شروط وأحكام مهلة زمنية للتمويل {" "}
      </h1>
      <div className="flex flex-col max-w-full sm:max-w-xl">
        <section className="mb-8 space-y-4 sm:space-y-6 border-b py-5">
          <h2 className="md:text-xl text-lg font-bold mb-2">
            شروط وأحكام مهلة زمنية للتمويل
          </h2>
          <p className="leading-relaxed md:text-base text-sm">
            تم إعداد هذه الشروط والأحكام ("الشروط") لتقديم إرشادات واضحة وشروط
            وأحكام ملزمة فيما يتعلق بالخدمات المقدمة للعميل من قبل شركة مهلة
            زمنية للتمويل، وهي شركة شخص واحد مساهمة مقفلة، بموجب سجل تجاري رقم
            1010977646، ورقم وطني موحد 7038141532، وهي شركة مرخصة وخاضعة لإشراف
            ورقابة البنك المركزي السعودي، وتتداول بالعلامة التجارية "مهلة زمنية
            للتمويل" (ويشار إليها هنا فيما بعد بـ "مهلة زمنية للتمويل"، "نحن"،
            "إنا" أو "الشركة"). وتحكم هذه الشروط استخدام تطبيق
            "تطبيق مهلة" لخدمات التمويل الاستهلاكي المصغر وموقع "مهلة"
            الإلكتروني ("موقع مهلة ") وعلاقة العميل مع الشركة وكذلك أي خدمات
            أخرى يتم إتاحتها من خلال استخدام تطبيق "مهلة" من حين
            لآخر ("الخدمات"). تتاح هذه الاتفاقية باللغتين العربية والانجليزية.
          </p>
          <p className="md:text-base text-sm">
            يتم تقديم هذه الشروط للعميل للاطلاع والقبول قبل منح الموافقة على
            استكمال عملية الدخول والتسجيل بالتطبيق (ويشار إليها هنا فيما بعد
            بـ"التسجيل"). ويعتبر التسجيل شرطًا مسبقًا لاستخدام تطبيق "مهلة"،
            وموقع "مهلة" والخدمات. ويتطلب التسجيل القيام بإجراءات "اعرف عميلك"
            ويشار إليها هنا فيما بعد بـ ("KYC") لكي يتم التحقق من صفة العميل
            كمستخدم مصرح له بالاستفادة من الخدمات عند القيام بقبول هذه الشروط.
          </p>
          <p className="md:text-base text-sm">
            يرجى قراءة هذه الشروط بعناية قبل الانتهاء من التسجيل حيث تؤثر الشروط
            على حقوقك والتزاماتك بموجب أنظمة المملكة العربية السعودية. إذا كنت
            لا توافق على هذه الشروط، فيرجى الامتناع عن استخدام موقع "مهلة" أو
            تطبيق "مهلة".
          </p>
          <p>
            {" "}
            بالتسجيل في خدمات تطبيق "مهلة"، فإنك تقر بأنك قد قرأت وفهمت وتوافق
            على الالتزام بهذه الشروط.
          </p>
        </section>{" "}
        <section className="mb-12 space-y-4 border-b py-5">
          <h2 className="md:text-xl text-lg font-semibold mb-4">التعاريف</h2>
          <h4>
            يكون للمصطلحات التالية المعاني المبينة أمام كل منها، وذلك مالم يقتضي
            سياق النص غير ذلك
          </h4>
          <p dir="rtl">
            <span className="font-bold">"الحساب"</span>: الحساب النقدي
            الإلكتروني الذي ينشئه العميل لدى تطبيق "مهلة" للاستفادة من الخدمات
            وذلك بعد التسجيل وقبول الشروط والأحكام المقدمة من شركة مهلة
          </p>
          <p dir="rtl">
            <span className="font-bold">"العميل"</span>: يشير إلى أي شخص، يبلغ
            من العمر 21 عامًا أو أكثر، قام بالتسجيل في خدمات تطبيق مهلة ووافق
            على الشروط والأحكام الخاصة بها على النحو المبين في هذه الاتفاقية
          </p>
          <p dir="rtl">
            <span className="font-bold">"بيانات الاعتماد"</span>: اسم المستخدم
            الخاص بالعميل وكلمة السر للدخول إلى تطبيق مهلة
          </p>
          <p dir="rtl">
            <span className="font-bold">"ساما"</span>: البنك المركزي السعودي
          </p>
          <p dir="rtl">
            <span className="font-bold">"سمة"</span>: الشركة السعودية للمعلومات
            الائتمانية (سمة)
          </p>
          <p dir="rtl">
            <span className="font-bold">"الرسوم"</span>: رسوم الخدمة التي تفرضها
            "مهلة" على الخدمات المختلفة المقدمة من تطبيق مهلة
          </p>
          <p dir="rtl">
            <span className="font-bold">"الائتمان"</span>: رصيد التمويل المتاح
            في الحساب
          </p>
          <p dir="rtl">
            <span>مركز خدمة عملاء تطبيق مهلة</span>: خدمة رعاية العملاء التي
            يمكن للعملاء الوصول إليها خلال ساعات العمل للإبلاغ عن أي مشاكل فنية
            يتعرضون لها من خلال استخدام تطبيق مهلة أو الخدمة من خلال القنوات
            المتاحة (باستخدام البريد الإلكتروني support@muhlah.sa، والاتصال على:
            8003010016) والتي تسمح لشركة مهلة زمنية للتمويل بالرد على هذه
            المشاكل أو معالجة أي استفسارات أخرى للعملاء
          </p>
          <p dir="rtl">
            <span className="font-bold">"التمويل"</span>: يشير إلى خدمة التمويل
            الاستهلاكي المصغر المقدمة للعميل. سيكون قرار "مهلة" بشأن أهلية
            العملاء للحصول على التمويل وفقًا لتقدير "مهلة" وحدها ووفقًا لمعايير
            وإجراءات الأهلية المحددة من قبل "مهلة"
          </p>
          <p dir="rtl">
            <span className="font-bold">"KYC"</span>: تشير إلى إجراءات "اعرف
            عميلك" وتفاصيل الهوية الشخصية للعميل والتي يتم مصادقتها والتحقق منها
            وفقًا لأنظمة البنك المركزي السعودي والجهات الحكومية الأخرى
          </p>

          <p dir="rtl">
            <span className="font-bold">"غسل الأموال"</span>: يشير إلى جميع
            الأنشطة المحظورة وفقًا لقوانين وأحكام مكافحة غسل الأموال في المملكة
            العربية السعودية
          </p>
          <p dir="rtl">
            <span className="font-bold">"البنك المقيد"</span>: المصرف المقيِّد
            لحساب مهلة المصرفي لتنظيم جميع المدفوعات والاحتفاظ بها نيابة عن
            العملاء
          </p>
          <p dir="rtl">
            <span className="font-bold">"الرمز السري"</span>: رقم التعريف الشخصي
            المكون من 6 أرقام، والذي اختاره العميل لتأمين حسابه
          </p>
          <p dir="rtl">
            <span className="font-bold">"التسجيل"</span>: عملية إنشاء حساب جديد
            لدى مهلة من خلال تقديم المعلومات المطلوبة للقيام بعملية التسجيل
            والتوثيق بغرض الاستفادة من خدمات ومنتجات مهلة
          </p>
          <p dir="rtl">
            <span className="font-bold">"SAR"</span>: عملة الريال السعودي
          </p>
          <p dir="rtl">
            <span className="font-bold">"خدمة تطبيق مهلة"</span>: عبارة عن تطبيق
            إلكتروني تقدمه "مهلة"، والتي من خلاله يمكن للعميل المسجل الحصول على
            تمويل وسداد التمويل من خلال تحويل الأموال داخل حدود المملكة العربية
            السعودية وفقًا للترخيص الصادر عن البنك المركزي السعودي
          </p>
          <p dir="rtl">
            <span className="font-bold">"حساب مهلة المصرفي"</span>: الحساب
            المصرفي المنشأ في البنك المقيد لتنظيم جميع المدفوعات، والاحتفاظ بها
            نيابة عن العميل
          </p>
          <p dir="rtl">
            <span className="font-bold">"علامة مهلة التجارية"</span>: العلامة
            التجارية لشركة مهلة للتمويل، المتخصصة في تقديم خدمات التقنية المالية
            وخدمات التمويل الاستهلاكي المصغر عبر التقنية ومصرح لها من قبل البنك
            المركزي السعودي
          </p>
          <p dir="rtl">
            <span className="font-bold">"رمز التفعيل"</span>: يعني الرمز السري
            المكون من 6 أرقام والذي يتم إصداره للعميل عند التسجيل في تطبيق
            "مهلة"، عن طريق أبشر، لتنشيط الحساب
          </p>
          <p dir="rtl">
            <span className="font-bold">"القائمة السوداء"</span>: قائمة تصدرها
            "سمة" بأسماء الأشخاص لدى تعثرهم عن سداد الدين
          </p>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 border-b py-5">
          <h2 dir="rtl" className="md:text-2xl text-xl font-semibold mb-4">
            المتطلبات والتسجيل في "مهلة"
          </h2>
          <p>
            يشترط التسجيل في تطبيق "مهلة" استكمال إجراءات "اعرف عميلك" والتحقق
            من هوية العميل وفقًا لأنظمة واشتراطات البنك المركزي السعودي.
          </p>{" "}
          <p>
            تحتفظ "مهلة" بالحق، في أي وقت، باتخاذ جميع الخطوات والإجراءات ذات
            الصلة اللازمة لضمان الامتثال لجميع متطلبات "اعرف عميلك" المشترطة من
            قبل البنك المركزي السعودي.
          </p>{" "}
          <p>يؤكد العميل أن جميع المعلومات المقدمة صحيحة وكاملة ودقيقة.</p> 
          <p>
            تحتفظ "مهلة" بالحق في أي وقت في رفض طلب التسجيل في حال وجود أي
            تباينات أو عدم دقة في المعلومات أو المستندات المقدمة من العميل.
          </p>{" "}
          <p>
            كجزء من عملية التسجيل في تطبيق "مهلة"، سيتلقى العميل رمز التفعيل عن
            طريق "أبشر"، والذي يجب إدراجه في تطبيق "مهلة" لتنشيط الحساب. يجب على
            العميل الموافقة على الشروط والأحكام في هذه الاتفاقية ليتم تنشيط
            الحساب. على العميل إنشاء كلمة مرور للدخول لتطبيق "مهلة"، ويمكن
            للعميل تغيير كلمة السر الخاصة به في أي وقت.
          </p>{" "}
          <p>
            يتحمل العميل وحده مسؤولية دقة المعلومات المقدمة للتسجيل في تطبيق
            "مهلة". إذا كانت المعلومات المقدمة من العميل غير صحيحة أو خاطئة أو
            مضللة، فإن "مهلة" لا تتحمل أية مسؤولية ولا تتحمل أي التزام عن أي
            عواقب قد تنجم عن توفير هذه المعلومات غير الصحيحة أو الخاطئة أو
            المضللة. إذا كان لدى العميل معرفة فعلية أو استنتاجية بشأن عدم دقة
            المعلومات المقدمة حول حسابه، يجب على العميل إخطار "مهلة" عن
            طريق التواصل معنا من خلال أحد قنوات الاتصال المتاحة في أقرب وقت
            ممكن. في حال اكتشفت "مهلة" أن المعلومات التي قدمها العميل خاطئة أو
            مضللة، فتحتفظ "مهلة" بالحق في إنهاء وحظر حساب العميل على الفور في أي
            وقت، مع أو بدون إشعار. سيكون الإنهاء بواسطة "مهلة" ساريًا على الفور
            أو كما هو محدد في الإشعار الصادر من "مهلة". يشمل إنهاء حساب العميل
            تعطيل وصول العميل إلى تطبيق "مهلة".
          </p>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 border-b py-5">
          <h2 dir="rtl" className="text-xl md:text-2xl font-semibold mb-4">
            شروط تطبيق "مهلة"
          </h2>
          <p>
            يجب ألا يتم تخزين أية أموال في أي وقت في حساب تطبيق "مهلة" للعملاء
            وفقًا للوائح البنك المركزي السعودي الحالية.
          </p>
          <p>
            يظل حساب تطبيق "مهلة" الخاص بالعميل نشطًا لمدة مائة وثمانون (180)
            يومًا من آخر معاملة أو تاريخ تنشيط الحساب.
          </p>
          <p>
            في حال فقدان أو تعطل رقم العميل المسجل في موقع "مهلة" فإنه يجب على
            العميل إخطار الشركة مباشرة بذلك من خلال خدمة المحادثة الفورية
            المتاحة في تطبيق "مهلة"؛ لإيقاف الخدمة وذلك لمنع وقوع أية إساءة
            استخدام لخدمات تطبيق "مهلة"، ومن صور إساءة الاستخدام على سبيل المثال
            لا الحصر: حالات الاحتيال، غسل الأموال، وتمويل الإرهاب، أن يكون ضمن
            القائمة السوداء.
          </p>
          <p>
            بالتقديم على تطبيق "مهلة"، يمنح العملاء موافقتهم وتفويض شركة "مهلة"
            لطلب الحصول على بياناتهم من أي وكالة أو مؤسسة مالية؛ للاطلاع على
            سجلاتهم المالية وغيرها من معلومات مالية؛ لتقييم وتحديد أهلية
            العملاء.
          </p>
          <p>
            يمنح العملاء كامل موافقتهم وتفويضهم لـ"مهلة" لطلب معلومات
            شخصية تتعلق بعملية "اعرف عميلك" من "أبشر" أو أي مؤسسة أخرى لتحديد
            وتقييم هوية الفرد وأهليته القانونية على الالتزام بالالتزامات المنصوص
            عليها في هذه الشروط والأحكام.
          </p>
          <p>
            لا يحق لشركة "مهلة" الإفصاح عن أية معلومات شخصية أو مستندات أو
            تفاصيل عن أية أنشطة في حساب العميل إلا إذا طلبت ذلك جهة حكومية
            متخصصة في مكافحة الاحتيال، وغسل الأموال وتمويل الإرهاب. أو في حال تم
            الحصول على موافقة العميل بذلك.
          </p>
          <p>يجوز لمهلة الكشف عن البيانات الشخصية عندما يكون الكشف ضروريا</p>
          <div>
            <ul
              className="list-disc list-inside text-right space-y-2"
              style={{ listStylePosition: "inside", direction: "rtl" }}
            >
              <li>
                لحماية الصحة أو السلامة العامة أو لحماية حياة أو صحة فرد أو
                أفراد معينين.
              </li>
              <li>
                للمعالجة اللاحقة بطريقة لا تؤدي إلى تحديد هوية مالك البيانات
                الشخصية أو أي فرد آخر على وجه الخصوص.
              </li>
            </ul>
          </div>
          <p className="leading-relaxed">
            ينبغي على العميل الالتزام بأية تعليمات ذات صلة بتطبيق "مهلة" صادرة
            عن مهلة.
          </p>
        </section>
        <section className=" mb-8 md:space-y-4 space-y-6  border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            تعليق وإغلاق الحساب والخدمات
          </h2>
          <p className="leading-relaxed md:text-base text-sm">
            <h4>
              تحتفظ "مهلة" بالحق في تعليق أو إيقاف خدمات "مهلة"، و تطبيق "مهلة"،
              كليًا أو جزئيًا، وفي حظر الحساب أو تقييده أو إنهائه أو تعليق
              استخدام أي رمز تنشيط حسب تقديرها، في أي وقت في أي من الحالات
              التالية
            </h4>{" "}
            <div>
              <ul
                className=" list-decimal text-right space-y-2"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>
                  إذا كان لدى "مهلة" سبب للاعتقاد بأن الهاتف المحمول أو الخط أو
                  الرمز الخاص بالعميل المستخدم للحصول على خدمات تطبيق "مهلة" يتم
                  استخدامه خلافًا لما تم الإفصاح عنه أو في أنشطة غير قانونية.
                </li>
                <li>
                  في حال قيام أي طرف اعتباري، أو تنظيمي أو حكومي متخصص أو أي
                  سلطة أخرى مماثلة ببدء تحقيق أو اتخاذ إجراءات تنظيمية أو إدارية
                  أو تنفيذية ضد العميل أو أي فعل آخر تعتقد "مهلة" أنه قد يضر
                  بسمعتها
                </li>
                <li>
                  {" "}
                  في حال عدم التزام العميل بالشروط أو اللوائح أو التعليمات ذات
                  الصلة باستخدام خدمات "مهلة" بما في ذلك شروط الاستخدام.
                </li>
                <li>
                  . في حال قيام العميل بإبلاغ "مهلة" بأن الرقم المسجل في تطبيق
                  "مهلة" قد فُقد أو سُرق أو تم الكشف عن الرمز السري على نحو غير
                  سليم لشخص آخر.
                </li>
                <li>
                  عند تلقي طلب من العميل لإغلاق الحساب، بعد أداء جميع التزاماته
                  تجاه "مهلة".
                </li>
                <li>
                  في حال حصول أعطال فنية، أو تعديل أو تحديث أو تغيير أو نقل أو
                  إصلاح أو صيانة بسبب حدث طارئ أو لأي أسباب فنية أخرى.
                </li>
                <li>
                  ي حال الاشتباه بانتهاك قواعد ولوائح وإرشادات البنك المركزي
                  السعودي أو انتهاك الشروط والأحكام المذكورة في هذه الاتفاقية.
                </li>
                <li>
                  لـ "مهلة" كامل الحق والصلاحية في إغلاق/تعليق حساب العميل حسب
                  تقديرها.
                </li>
              </ul>
            </div>
            <div className="mt-3 space-y-4">
              <p>
                كما أن "مهلة" ليست مسؤولة أمام العميل ضد أية خسارة أو عيب أو
                أضرار مباشرة أو غير مباشرة ناتجة عن أي سلوك أو إغفالٍ من العميل
                بوضع حسابه في حال الإغلاق أو التعليق
              </p>
              <p>
                حساب ائتمان العميل هو حق خاص به خلال فترة حياته، وفي حال وفاة
                العميل، يتم إسقاط كامل المبلغ المتبقي من المديونية ويعتبر
                التمويل مغلق بعد أن يقدم الورثة شهادة وفاة رسمية إلى مركز خدمة
                العملاء.
              </p>
              <p>
                وفي حال وجود أي عيب يقع ضمن مسؤولية "مهلة" في تشغيل الخدمة لأي
                سبب، فإن "مهلة" ستكون ملتزمة بتخفيف تأثير الضرر الذي يلحق
                بالتطبيق، إن وجد.
              </p>
            </div>
            <div className="mt-7 space-y-3 ">
              <h4>رسوم الخدمة</h4>
              <p className="leading-9">
                يجب على العميل دفع رسوم الخدمة المنصوص عليها من قبل "مهلة"
                بالشكل والطريقة المحددة لهذا الدفع. سيمكن هذا الحساب العميل من
                الاستفادة من الخدمات التالية
              </p>
            </div>
            <div>
              <ul
                className="list-disc list-inside text-right"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>التمويل</li>
                <li>
                  الوصول للمبلغ الائتماني المعتمد بطرق مختلفة، على سبيل المثال
                  لا الحصر: التحويل من تطبيق "مهلة" إلى الحساب المصرفي، والدفع
                  لتجار التجزئة المشاركين للحصول على السلع والأصول.
                </li>
              </ul>
            </div>
            <p className="mt-4">
              بعد الانتهاء من أيّ معاملة لدى تطبيق"مهلة"، سيتلقى العميل رسالةً
              نصيةً قصيرة، تتضمن وصفًا للمعاملة المالية لأحدث رصيد ائتمان في
              الحساب.
            </p>{" "}
          </p>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 border-b py-5">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            الأمان والاستخدام غير المصرح به
          </h2>
          <p>
            {" "}
            يحتوي كل حساب على رمز واحد يستطيع العميل من خلاله الدخول إلى الحساب.
          </p>
          <p>
            يتحمل العميل وحده المسؤولية عن سرية وأمان وسلامة الرمز وبيانات
            الاعتماد الأخرى الخاصة به.
          </p>{" "}
          <p>
            يتحمل العميل وحده المسؤولية عن العواقب الناشئة عن الإفصاح عن الرمز
            و/أو الاستخدام غير المصرح به لخدمة تطبيق "مهلة"، ويضل العميل مسؤولاً
            عند تعيين طرف ثالث بقصد أو بغير قصد للتصرف بالنيابة عنه.
          </p>
          <p>
            وفي حالة فقدان الرمز، أو الهاتف المحمول، أو وضعه في غير موضعه، أو
            تعرضه للخطر، يجب على العميل إبلاغ "مهلة" على من خلال أحد قنوات
            الاتصال المتاحة حيث سيتم حظر حساب تطبيق "مهلة" وسيتم إصدار بيانات
            اعتماد جديدة للعميل بعد التحقق من صحتها.
          </p>
          <p>
            يتحمل العميل مسؤولية حماية هواتفه المحمولة واستخدامها الصحيح، كما
            أنه مسؤول عن الحفاظ على سرية الرمز وجميع معاملات خدمات "مهلة"
            المنجزة من خلال الرمز ذاته.
          </p>
          <p>
            يحق للعميل تغيير كلمة السر من خلال قائمة الخدمة في التطبيق وفي أي
            حال من الأحوال، يجب على العميل تعريف نفسه عند القيام بأي معاملة من
            خلال تطبيق "مهلة" باستخدام هاتفه المحمول والرمز الخاص به. ويحظر على
            العميل الكشف عن الرمز لأي شخص، بما في ذلك موظف خدمة العملاء أو مركز
            خدمة العملاء.
          </p>
          <h4>التزامات العميل</h4>
          <p>
            يتحمل العميل مسؤولية جميع رسوم معاملات خدمات "مهلة" التي يتم الدخول
            إليها باستخدام الرمز، عبر الهاتف المحمول.
          </p>
          <p>
            لا يجوز للعميل استخدام تطبيق "مهلة"، أو خدمات "مهلة" لأي غرض يمكن
            تفسيره على أنه مخالف أو غير مقبول وفقًا لأي أنظمة نافذة، ولوائح
            البنك المركزي السعودي، والإرشادات والأحكام القضائية، وسياسة "مهلة"
            أو السياسة العامة أو لأي غرض قد يضر سلبًا بسمعة "مهلة".
          </p>
          <p>
            يجب على العميل إبلاغ مهلة فور اكتشاف أي إجراءات غير قانونية تتعلق
            بالمنتج أو الخدمة المقدمة عن طريق قنوات الاتصال المتاحة.
          </p>
          <p>
            يقر العميل بالمسؤولية تجاه عدم مشاركة بياناته الشخصية أو المالية لأي
            جهة أخرى عدا "مهلة" في أية حال.
          </p>
          <p>
            يقر العميل ويتعهد بأن جميع المعلومات التي تم إدخالها في تطبيق "مهلة"
            أو المقدمة بطريقة أخرى إلى تطبيق "مهلة" صحيحة وكاملة ومحدثة، بما في
            ذلك المعلومات الشخصية المتعلقة بالحساب. وعند تنفيذ إحدى المعاملات
            ستعتمد منصة "مهلة" على معلومات التسجيل التي قدمها العميل.
          </p>
          <p>
            يقر العميل بأن أي أخطاء في المعلومات، بما في ذلك الخطأ في تعريف
            المستفيد (المستفيدين) أو أسماء وأرقام الحساب غير الصحيحة أو غير
            المتسقة أو الأخطاء الإملائية، هي مسؤوليته وأن تطبيق "مهلة" لن يتحمل
            أية مسؤولية عن تنفيذ أي معاملة بناءً على المعلومات غير الدقيقة أو
            غير الكاملة المقدمة من العميل أو التي يدخلها العميل.
          </p>
          <p>
            إن خدمات "مهلة" مخصصة للاستخدام في المملكة العربية السعودية، وعلى
            وجه التحديد دون الحصر، ومن المعلوم لدى العميل أنه لا يجوز له استخدام
            الخدمة حيثما يكون ذلك (أ) ناتجًا عن أو ينطوي على ممارسات تندرج ضمن
            الجريمة أو الاحتيال أو أي نشاط آخر غير سوي؛ (ب) تم إرساله بغرض
            المقامرة، بما في ذلك وضع الرهانات أو دفع الأرباح؛ (د) من ضمن الأحوال
            التي تحدد "مهلة" أنها مشبوهة أو قد تنتهك النظام أو اللوائح السارية،
            بما في ذلك الأنظمة التي تهدف إلى كشف ومنع غسل الأموال أو تمويل
            الإرهاب أو الاتجار بالبشر أو الاحتيال أو فرض ضوابط على أسعار العملات
            أو صرف العملات.
          </p>
          <p>
            ويوافق العميل على أنه سيطلب فقط معاملة تتفق مع الشروط والأحكام
            المذكورة.
          </p>
          <p>
            يتوجب على العميل الحذر عند منح وكالة رسمية لشخص آخر لإنجاز تعاملاته
            المالية. وعليه معرفة المخاطر عند منحها. ويتحمل العميل مسؤولية أي
            تعاملات تقام من قِبل الموكلين من طرفه.
          </p>
        </section>
        <section id="protection" className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            حماية البيانات والسرية
          </h2>
          <div className="space-y-4">
            <h4>
              تخضع خصوصية التواصل للشروط التي يصدرها البنك المركزي السعودي
              وقراراته وتعاميمه. ويوافق العميل على أنه من أجل تسهيل توفير
              خدمات"مهلة"، قد يُطلب من "مهلة" بموجب القانون أو بطريقة أخرى الكشف
              عن أية معلومات أو تفاصيل حول العميل لأي جهة حكومية أو عندما يتم
              الإفصاح بموافقة كتابية من العميل بعد أخذ عدم الممانعة من البنك
              المركزي.
            </h4>{" "}
            <h4>
              من خلال التقدم بطلب للحصول على خدمة "مهلة"، يجب على العملاء منح
              موافقتهم الكاملة وتفويضهم لمهلة لطلب بيانات العميل من غير-المالك
              أو معالجتها لغرض آخر غير الغرض الذي تم جمعها من أجله. في مثل هذه
              الحالات، لن يتم تسجيل البيانات الشخصية للعميل أو تخزينها بطريقة
              تجعله من الممكن تحديد المالك ومعرفته بشكل مباشر أو غير مباشر
            </h4>
            <h4>
              عندما يكون غير-المالك من جهة تنظيمية أو وكالة حكومية، فلن ينطبق
              البند أعلاه
            </h4>
            <h4>
              من خلال التقدم بطلب إلى الخدمة المقدمة من قبل "مهلة"، يدرك العميل
              تمامًا ويقر بأنه سيتم استخدام الحد الأدنى من البيانات الشخصية
              التالية لأغراض "اعرف عميلك" والتسويق.
            </h4>
            <div>
              <ul
                className="list-disc list-inside text-right"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>الاسم (اعرف عميلك والتسويق)</li>
                <li> رقم الهوية/الإقامة (اعرف عميلك) </li>
                <li> العنوان الوطني (اعرف عميلك)</li>
                <li> رقم الاتصال (اعرف عميلك والتسويق)</li>
                <li> رقم الحساب البنكي (ايبان) (اعرف عميلك)</li>
                <li> رقم الحساب الجاري (اعرف عميلك)</li>
              </ul>
            </div>
            <h4>
              باستثناء البيانات الحساسة، تقوم مهلة بمعالجة البيانات الشخصية
              لأغراض التسويق.
            </h4>{" "}
            <div>
              <h4>وفقا للائحة، تعتبر البيانات التالية بيانات حساسة</h4>
              <ul
                className="list-disc list-inside text-right"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>العلاقة مع السلطات المدنية السعودية</li>
                <li>بيانات الائتمان</li>
              </ul>
            </div>{" "}
            <h4>
              وتتم حماية رسومات المستخدم والشعارات والتصاميم والتجميع والمعلومات
              وشفرة الكمبيوتر والمنتجات والبرامج والخدمات وجميع العناصر الأخرى
              في خدمات تطبيق "مهلة" التي تقدمها "مهلة" ("المواد") بقوانين حقوق
              النشر والتصاميم وبراءات الاختراع وقوانين العلامات التجارية
              والاتفاقيات الدولية وغيرها من حقوق الملكية الفكرية المعمول بها.
            </h4>{" "}
            <h4>
              لا يمكن الدخول إلى المعلومات الشخصية والمالية للعميل واستخدامها
              إلا من قبل الموظفين ذو الصلاحية
            </h4>{" "}
            <div>
              <h4 className="mb-4">
                يتمتع العميل بالحقوق التالية فيما يتعلق بالبيانات الشخصية للعميل
              </h4>
              <ul
                className="list-disc list-inside text-right"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>
                  {" "}
                  الحق في المعرفة، بما في ذلك إبلاغ العميل بشكل فعال بالمبرر
                  القانوني أو العملي لجمع بياناته الشخصية، والغرض منها، وأن
                  بياناته لن تتم معالجتها لاحقا بطريقة لا تتوافق مع الغرض من
                  الجمع أو في ظروف أخرى غير تلك الأغراض التجارية التي تقدمها
                  مهلة.
                </li>
                <li>
                  للعميل الحق في الوصول إلى بياناته الشخصية المتاحة لمهلة، مثل
                  هذاالحق الذي توفره مهلة لهذه البيانات بما في ذلك القدرة على
                  الحصول على نسخة من البيانات الشخصية للعملاء بتنسيق واضح ومطابق
                  لمحتويات السجلات، وبدون رسوم.
                </li>
                <li>
                  يحق للعملاء طلب تصحيحات أو إكمال أو تحديث بياناتهم الشخصية
                  المتاحة لمهلة.
                </li>
                <li>
                  يحق للعملاء طلب إتلاف بياناتهم الشخصية المتاحة لمهلة، بعد 10
                  سنوات من فترة الاحتفاظ بالبيانات الشخصية للعميل في تطبيق مهلة
                </li>
              </ul>
            </div>{" "}
            <div className="space-y-4">
              <h4>
                يحتفظ حساب "مهلة" البنكي بجميع معلومات الدفع والأموال الأخرى
                المستلمة في حساب الائتمان المسجل في حساب العميل (المبالغ
                الائتمانية) كمعلومات سرية.
              </h4>
              <h4>
                سيكون العميل هو المستفيد الوحيد من المبالغ الائتمانية في حساب
                العميل لدى "مهلة". ويوافق العميل بموجب هذه الاتفاقية على
                الاحتفاظ سجلات نظام تطبيق "مهلة" في حساب مهلة المصرفي كوسيلة
                مادية للتحقق من مبلغ النقود الإلكترونية المتاح في أي وقت في حساب
                العميل، ويضل العميل وحده مسؤول عن جميع المبالغ النقدية عندما
                يقوم بتعيين طرف ثالث بقصد أو بغير قصد للتصرف نيابة عنه.
              </h4>
              <h4>
                لا يلتزم البنك المقيِّد لحساب "مهلة" البنكي بإجراء تحقيق مستقل
                في شرعية المبالغ المقيدة لحساب العميل.
              </h4>
              <h4>
                لا يحق للعميل المطالبة بأي مزايا قد تتراكم من مبلغ الائتمان ويحق
                للبنك المقيد الاحتفاظ بالمزايا لاستخدامها من جانبه في أي غرض من
                الأغراض.
              </h4>
              <h4>
                {" "}
                يجب أن تستخدم "مهلة" جميع التدابير المعقولة لضمان أن تظل معاملات
                العملاء ومعلوماتهم آمنة وسرية. ولا تقدم "مهلة" أي ضمان من أي نوع
                حول النظام والشبكة أو وظيفتها أو أدائها، أو لأي خسارة أو ضرر،
                متى وأينما تعرض لها العميل أو أي شخص آخر أو تكبدها وتنتج عن أو
                فيما يتعلق باستخدام خدمات تطبيق "مهلة".
              </h4>
            </div>{" "}
          </div>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            إخلاء المسؤولية والتعويض
          </h2>
          <div className="space-y-4">
            <p>
              يتم توفير التطبيق أو المواد الموجودة على التطبيق أو أي منتج أو
              خدمة يتم الحصول عليها من خلال التطبيق "كما هي" وبدون أي ضمانات من
              أي نوع، سواء كانت صريحة أو ضمنية إلى أقصى حد مسموح به وفقاً
              للقانون المعمول به
            </p>{" "}
            <p>
              تخلي شركة "مهلة" والشركات التابعة لها والمرخصون لديها والموردون
              والمعلنون والجهات الراعية والوكلاء مسؤوليتها عن جميع الضمانات،
              الصريحة أو الضمنية، بما في ذلك، على سبيل المثال لا الحصر، الضمانات
              الضمنية للملكية وعدم التعدي والدقة والقابلية للتسويق والملاءمة
              لغرض معين وأي ضمانات قد تنشأ من خلال التعامل، أو سياق الأداء أو
              استخدام التجارة.
            </p>{" "}
            <p>
              لا تضمن "مهلة" والشركات التابعة لها والمرخصون لديها والموردون
              والمعلنون والجهات الراعية والوكلاء أن استخدامك للتطبيق سيكون دون
              انقطاع أو خاليًا من الأخطاء أو آمن، وأنه سيتم تصحيح العيوب أو أن
              التطبيق خالي من الفيروسات أو غيرها من المكونات الضارة.
            </p>{" "}
            <p>
              يقر العميل بأنه مسؤول عن الحصول وصيانة جميع الأجهزة المحمولة
              والأجهزة الأخرى اللازمة للدخول إلى التطبيق واستخدامه وجميع الرسوم
              المرتبطة به.
            </p>{" "}
            <p>
              يتحمل العميل كل المسؤولية والمخاطر عن استخدام تطبيق وخدمات "مهلة"
              والاعتماد عليه. ولم يتم تقديم رأي أو نصيحة أو بيان من "مهلة"
              والشركات التابعة لها والمرخصين لديها والموردين والمعلنين والجهات
              الراعية والوكلاء والأعضاء أو الزائرين، سواء تم تقديمها عبر التطبيق
              أم لا ولن ينشأ عنها أي ضمان. إن استخدام العميل للتطبيق والخدمات
              وجميع المواد المقدمة من خلال التطبيق سوف تكون على مسؤوليته بالكامل
              وحده.
            </p>{" "}
            <p>
              لا تقدم "مهلة" أي ضمان صريح أو ضمني أو ضمان أو تعهد من أي نوع فيما
              يتعلق بخدمات بتطبيق "مهلة"، والتي لم يتم ذكرها صراحةً في هذه
              الاتفاقية.
            </p>{" "}
            <p>
              لن تكون شركة "مهلة" مسؤولة عن أي أفعال أو سهو من جانب أي طرف ثالث
              بما في ذلك الخدمات غير المصرح بها صراحةً بواسطة منصة "مهلة".
            </p>{" "}
            <p>
              لا تتحمل "مهلة" أي مسؤولية تجاه أي شخص عن أي تأخير أو خسارة في
              الأعمال أو الربح أو الإيرادات أو الشهرة أو المدخرات المتوقعة أو
              الأضرار أو الرسوم أو التكاليف أو النفقات التي تنشأ من أي نوع على
              خدمات منصة "مهلة" بسبب عدم توفر/استخدام خدمات تطبيق "مهلة" أو غير
              ذلك.
            </p>{" "}
            <p>
              يوافق العميل على تعويض "مهلة" و/أو الأطراف ذات الصلة والدفاع عنهم
              وحمايتهم من جميع المطالبات والخسائر والأضرار والالتزامات والتكاليف
              والنفقات، بما في ذلك على سبيل المثال لا الحصر الرسوم والنفقات
              القانونية الناشئة عن أو المتعلقة باستخدام أو إساءة استخدام خدمات
              تطبيق "مهلة"، وعن أي انتهاك لهذه الشروط والأحكام، أو أي خرق
              للضمانات والتعهدات.
            </p>
          </div>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            التغييرات في الشروط والأحكام
          </h2>
          <div className="space-y-4">
            <p>
              يحق لشركة "مهلة" إجراء أي تغييرات على هذه الشروط في أي وقت. وفي
              حال أي تغيير يجب على "مهلة" إخطار عملائها عن طريق وسائل الاتصال
              المضمونة بالنسخة المحدثة من الشروط في غضون ثلاثون (30) يوم عمل على
              الأقل قبل إجراء أي تغيير، وتزود "مهلة" العملاء بنسخة محدثة من
              الشروط، ويتم نشر إعلان عن هذه التغييرات عن طريق أي وسيلة مناسبة
              تكون كافية للعميل ليتم إبلاغه رسميا.
            </p>
            <p>
              في حال اعتراض العميل أو عدم موافقته على التغيير في الشروط والأحكام
              يجب على العميل رفع اعتراضه لـ"مهلة" خلال عشر (10) أيام عمل من وقت
              استلامه لإشعار التغيير في الشروط والأحكام.
            </p>

            <p>
              تخضع الشروط الواردة في هذه الاتفاقية للإشعارات/الإرشادات الصادرة
              عن البنك المركزي السعودي من وقت لآخر.
            </p>
          </div>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
             الشروط والأحكام العامة
          </h2>
          <div className="space-y-4">
            <p>
              يجب على العميل إبلاغ "مهلة" على الفور بأي تغييرات تطرأ على
              معلوماته الشخصية في نموذج طلب التسجيل.
            </p>{" "}
            <p>
               ويجب الإبلاغ عن أي نزاع مع أو تقديم شكوى ضد أي خدمات مالية مقدمة
              من خلال أحد قنوات الاتصال المتاحة.
            </p>
            <p>
              يحق لشركة "مهلة" التحقيق في الادعاء والتقرير بحسن نية وفقًا
              لتقديرها الخاص وحل أي خلافات بشكل عادل وودي.
            </p>{" "}
            <p>
              في حال وجود أي نزاع، ستكون سجلات تطبيق "مهلة" ملزمة كدليل قاطع على
              المعاملات التي تتم من خلال استخدام خدمات منصة "مهلة".
            </p>
            <p>
              تمتلك "مهلة" جميع حقوق النشر والعلامات التجارية وجميع حقوق الملكية
              الفكرية الأخرى في المواد ويوافق العميل بموجب هذا على أنه لا يحق له
              استخدام هذه الحقوق أو المطالبة بها.
            </p>
            <p>
              يوافق العميل على تلقي رسائل نصية قصيرة SMS من "مهلة" عبر رقم
              الهاتف المحمول المحدد في نموذج طلب التسجيل.
            </p>
            <p>
              تعتبر هذه الشروط (أو أي نسخة معدلة) اتفاقية تلزم العميل أو ممثليه
              بالشروط والأحكام المنصوص عليها في هذه الاتفاقية.
            </p>
            <p>
              لا يجوز تحويل هذه الشروط أو إحالتها إلى أي شخص آخر باستثناء العميل
              المحدد في نموذج التسجيل.
            </p>
            <p>
              جميع الحقوق والتعويضات المذكورة في هذه الاتفاقية تراكمية ولا
              تستبعد أي حقوق أو تعويضات ينص عليها القانون.
            </p>
          </div>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
             النظام الواجب التطبيق وتسوية النزاعات{" "}
          </h2>
          <div className="space-y-4">
            <p>
              يكون تنفيذ هذه الاتفاقية وتفسيره وفقًا للأنظمة واللوائح والتعليمات
              والقرارات وأي أداة نظامية معمول بها في المملكة العربية السعودية،
              وكل خلاف قد ينشأ في هذا الشأن ولا يتوصل فيه إلى تسوية ودية بين
              الطرفين يحال إلى الجهة القضائية المختصة في المملكة العربية
              السعودية  في مدينة الرياض للفصل فيه بشكل نهائي.
            </p>
          </div>
        </section>
        <section className="mb-8 md:space-y-4 space-y-6 ">
          <h2 className="md:text-2xl text-xl font-semibold mb-4">
            موافقة العملاء
          </h2>
          <div className="space-y-4">
            <h4>
              أقر بموجب هذا بأنني قرأت ما سبق وأفهم بوضوح المحتوى بما في ذلك
              معالجة البيانات الشخصية والعملية الأساسية لتقييم وتحديد أهلية
              العميل للحصول على التمويل من مهلة ، بالموافقة على ما سبق، أقر
              وأوافق على ما يلي
            </h4>{" "}
            <div>
              <ul
                className="list-disc list-inside text-right"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>
                  بتوقيعي على أي نموذج أو مستند، يعتبر التوقيع اعتمادًا وتأكيدًا
                  لمضمون النموذج أو المستند.
                </li>
                <li>
                  تفويض مهلة بالحصول على شهادة الراتب من أحد الشركات النظامية
                  المصرح لها، والسماح لهم بالاطلاع على الحسابات البنكية الخاصة
                  بي من خلال المصرفية المفتوحة وذلك لتقييم وتحديد أهلية العميل
                  للحصول على التمويل
                </li>
                <li>
                  تفويض مهلة بمعالجة معلوماتي الشخصية بما يتوافق مع المتطلبات
                  التنظيمية والتشريعية ولغرض عمليات مهلة المطلوبة للموافقة على
                  التمويل.
                </li>
                <li>
                  أصرح لشركة "مهلة" الحصول على معلوماتي من خلال منصة أبشر أو أي
                  خدمة أخرى تتيح عملية التوثيق والحصول على المعلومات الشخصية.
                </li>
                <li>
                  أفهم وأقر أنه عندما ينطبق ما يلي، فإن موافقتي كمالك للبيانات
                  لن تنطبق على معالجة البيانات.
                </li>
                <li>
                  مهلة غير قادرة على الاتصال بي الا من خلال رقم الهاتف المحمول
                  والبريد الإلكتروني والعنوان المقدم أثناء التسجيل.
                </li>
                <li>
                  {" "}
                  تقوم مهلة بالتحقق من صحة بياناتي الشخصية بناء على طلب القرض
                  السابق.
                </li>
                <li>
                  أصرح لشركة "مهلة" بالدخول إلى تقريري الائتماني لأغراض فحص
                  السجل الائتماني عن طريق الشركة السعودية للمعلومات الائتمانية
                  (سمة).
                </li>
                <li>
                  {" "}
                  في حال حصولي على منتج ائتماني،أصرح لشركة "مهلة" مشاركة تسجيل
                  وتحديث معلومات المنتج وتفاصيل السداد وذلك بحسب ما تقتضيه أنظمة
                  وتعليمات المعلومات الائتمانية عن طريق الشركة السعودية
                  للمعلومات الائتمانية (سمة).
                </li>
                <li>
                  أقر بأن مسؤوليتي هي مراجعة بيانات حسابي والإشعارات ذات الصلة
                  فور استلام الإخطار ذي الصلة.
                </li>
                <li>
                  أوافق على أن أسدد إلى "مهلة" أي ائتمانات أو رسوم أو ضرائب
                  مستحقة تم تكبدها على حسابي.
                </li>
                <li>
                  أوافق على أنه في الحالات التالية فقط سيتم نقل بياناتي الشخصية
                  خارج المملكة أو الكشف عنها إلى طرف خارج المملكة
                </li>
              </ul>
            </div>{" "}
            <p>
              الطرف الذي يتم الكشف عن البيانات الشخصية له اتفاق مع المملكة، أو
              لديه مصالح لخدمة المملكة، أو لأغراض أخرى على النحو الذي تحدده
              الأنظمة
            </p>
            <p>
              {" "}
              الكشف عن البيانات لا يخل بالأمن الوطني أو المصالح الحيوية للمملكة
            </p>
            <p>
              قام الطرف خارج المملكة بدمج قوانين خصوصية البيانات المشابهة لقانون
              حماية البيانات الشخصية المتبعة في المملكة والذي اعتمدته مهلة.
              (PDPL - Personal Data Protection Law)
            </p>
            <div>
              <ul
                className="list-disc list-inside text-right"
                style={{ listStylePosition: "inside", direction: "rtl" }}
              >
                <li>
                  تكون مشاركة البيانات الشخصية معتمدة من قبل البنك المركزي
                  السعودي.
                </li>
                <li>
                  أوافق على أن أكون مسؤولا عن أي أضرار أو تكاليف أو إنهاء للحساب
                  الذي يتكبده إخفاقي في الإقرار ببيانات حسابي والإشعارات ذات
                  الصلة أو بياناتي الشخصية ويجب علي "مهلة"إبلاغي بشأن الأضرار أو
                  التكاليف أو إنهاء إلغاء الحساب.
                </li>
                <li>
                  أوافق على أن تتمكن "مهلة" من عرض اسمي على صفحات تطبيق مهلة
                  وعلى صفحة الترحيب قبل تسجيل الدخول وأثناء استخدامي لتطبيق
                  "مهلة".
                </li>
                <li>
                  أوافق على إخطار "مهلة" كتابة أو عبر الهاتف بأي تغييرات تطرأ
                  على معلومات حسابي أو غيرها من المعلومات التي قدمتها فيما يتعلق
                  بهذه الشروط.
                </li>
              </ul>
            </div>
            <p>
              أوافق على تقديم موافقتي على إرسال "مهلة" مواد إعلانية أو توعوية.
            </p>
          </div>
        </section>
      </div>
    </div>
  );
};

export default TermsSection;
