import Image from "next/image";
import { sharia1, sharia2, sharia3 } from "@/public/assets/index";

const members = [
  {
    name: "الشيخ د. فيصل بن صالح الشمري",
    position: "عضو اللجنة",
    image: sharia3,
    description:
      "محامي ومستشار شرعي وقانوني، وعضــو لجنــة إعــادة صياغــة المعيــار الشــرعي للصكــوك الاسـتثمارية فـي AAOIFI، وعضـو فـي عـدد مـن اللجـان الشـرعية فـي المؤسســات الماليــة، ولــه مســاهمات فــي عــدة مؤتمــرات ونــدوات، وأبحاث ومؤلفات في المعاملات المالية المعاصرة، كما ساهم في تطوير العديد من منتجات التقنية المالية والمنتجات البنكية بشكل عام.",
  },
  {
    name: "الشيخ د. خالد بن محمد السياري",
    position: "عضو اللجنة",
    image: sharia2,
    description:
      "الأستاذ مشارك بقسم الفقه بالجامعة السعودية الإلكترونية، وعضو لجنة المعايير الشرعية، ولجنة مراجعة وصياغة مستندات المعايير الشرعية في هيئة المحاسبة والمراجعة للمؤسسات المالية الإسلامية AAOIFI، وعضو عدد من اللجان الشرعية في المؤسسات المالية، وله مساهمات في عدة مؤتمرات وندوات، وأبحاث ومؤلفات في المعاملات المالية المعاصرة.",
  },
  {
    name: "الشيخ أ.د. سعد بن تركي الخثلان",
    position: "رئيس اللجنة الشرعية",
    image: sharia3,
    description:
      "يعمل فضيلة الشيخ الدكتور سعد بن تركي الخثلان أستاذًا في قسم الفقه بجامعة الإمام محمد بن سعود الإسلامية بالرياض، ويرأس مجلس إدارة الجمعية الفقهية السعودية، وهو عضو في عدد من اللجان، منها: عضو اللجنة الشرعية بمصرف الراجحي، عضو اللجنة العليا لتدوين الأحكام القضائية، بالإضافة إلى عضوية سابقة في هيئة كبار العلماء. وقد حصل الشيخ على درجة الدكتوراه من جامعة الإمام محمد بن سعود الإسلامية.",
  },
];

export default function ShariaCommitteeSection() {
  return (
    <section className="mx-auto px-4 bg-white min-h-screen text-black">
      {/* Hero Section */}
      <div className="text-center pt-16 pb-12">
        <h1 className="text-4xl font-bold mb-4">اللجنة الشرعية</h1>
        <p className="text-lg text-gray-600 max-w-xl mx-auto">
          استنادًا إلى التزامنا التام بأحكام الشريعة الإسلامية، تعتمد شركة مهلة
          زمنية للتمويل سياسات وإجراءات متوافقة مع مبادئ وأحكام الدين الإسلامي.
          وتقوم اللجنة الشرعية بدور فاعل في مراجعة جميع أنشطتنا التمويلية
          والتأكد من مشروعيتها وتوافقها مع الضوابط الشرعية، حرصًا على التزام
          الشركة بالقيم الإسلامية في جميع جوانب أعمالها.
        </p>
      </div>

      {/* Sharia Committee Members */}
      <div className="flex flex-wrap justify-center  gap-8 mb-16">
        <div className="flex flex-col md:flex-row md:gap-16 justify-center items-center w-full sm:w-1/3 lg:w-1/2  text-center md:text-right p-4">
          <Image
            src={sharia1}
            alt="الشيخ أ.د. سعد بن تركي الخثلان"
            width={150}
            height={150}
            className="rounded-md border border-gray-300"
          />
          <div>
            <h2 className="mt-4 text-xl font-bold">
              الشيخ أ.د. سعد بن تركي الخثلان
            </h2>
            <h3 className="text-blue-500 mb-2">رئيس اللجنة الشرعية</h3>
            <p className="text-gray-700 text-sm max-w-sm">
              يعمل فضيلة الشيخ الدكتور سعد بن تركي الخثلان أستاذًا في قسم الفقه
              بجامعة الإمام محمد بن سعود الإسلامية بالرياض، ويرأس مجلس إدارة
              الجمعية الفقهية السعودية، وهو عضو في عدد من اللجان، منها: عضو
              اللجنة الشرعية بمصرف الراجحي، عضو اللجنة العليا لتدوين الأحكام
              القضائية، بالإضافة إلى عضوية سابقة في هيئة كبار العلماء. وقد حصل
              الشيخ على درجة الدكتوراه من جامعة الإمام محمد بن سعود الإسلامية.
            </p>
          </div>
        </div>

        <div className="w-full sm:w-1/3 lg:w-1/2 text-center p-4 flex flex-col sm:flex-row  gap-12 md:gap-32">
          <div className="flex flex-col items-center">
            <Image
              src={sharia2}
              alt="الشيخ د. خالد بن محمد السياري"
              width={150}
              height={150}
              className="rounded-md border border-gray-300"
            />
            <h2 className="mt-4 text-xl font-bold">
              الشيخ د. خالد بن محمد السياري
            </h2>
            <h3 className="text-blue-500 mb-2">عضو اللجنة</h3>
            <p className="text-gray-700 text-sm">
              الأستاذ مشارك بقسم الفقه بالجامعة السعودية الإلكترونية، وعضو لجنة
              المعايير الشرعية، ولجنة مراجعة وصياغة مستندات المعايير الشرعية في
              هيئة المحاسبة والمراجعة للمؤسسات المالية الإسلامية AAOIFI، وعضو
              عدد من اللجان الشرعية في المؤسسات المالية، وله مساهمات في عدة
              مؤتمرات وندوات، وأبحاث ومؤلفات في المعاملات المالية المعاصرة.
            </p>
          </div>
          <div className="flex flex-col items-center">
            <Image
              src={sharia3}
              alt="الشيخ د. فيصل بن صالح الشمري"
              width={150}
              height={150}
              className="rounded-md border border-gray-300"
            />
            <h2 className="mt-4 text-xl font-bold">
              الشيخ د. فيصل بن صالح الشمري
            </h2>
            <h3 className="text-blue-500 mb-2">عضو اللجنة</h3>
            <p className="text-gray-700 text-sm">
              محامي ومستشار شرعي وقانوني، وعضــو لجنــة إعــادة صياغــة
              المعيــار الشــرعي للصكــوك الاسـتثمارية فـي AAOIFI، وعضـو فـي
              عـدد مـن اللجـان الشـرعية فـي المؤسســات الماليــة، ولــه
              مســاهمات فــي عــدة مؤتمــرات ونــدوات، وأبحاث ومؤلفات في
              المعاملات المالية المعاصرة، كما ساهم في تطوير العديد من منتجات
              التقنية المالية والمنتجات البنكية بشكل عام.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}
